betfair/templates/global/BFGlobalService.login.req.xml

<?xmlversion='1.0'encoding='UTF-8'?>
<SOAP-ENV:Envelope
xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/'
xmlns:SOAP-ENC='http://schemas.xmlsoap.org/soap/encoding/'
xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
xmlns:xsd='http://www.w3.org/2001/XMLSchema'
xmlns:ns2='http://www.betfair.com/publicapi/types/global/v3/'
xmlns:ns1='http://www.betfair.com/publicapi/v3/BFGlobalService/'>
<SOAP-ENV:Body>
<ns1:login>
<ns1:request>
<header>
<sessionToken></sessionToken>
</header>
<ipAddress></ipAddress>
<locationId>0</locationId>
<password></password>
<productId>0</productId>
<username></username>
<vendorSoftwareId>0</vendorSoftwareId>
</ns1:request>
</ns1:login>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
